In [ ]:
# Assign a list using brackets, with elements separated by commas.
x = ["Now", "we", "are", "cooking", "with", 7, "ingredients"]

# Print element at index 3.
print(x[3])

In [ ]:
print(x[7])

In [ ]:
x[1:3]

In [ ]:
x[:2]

In [ ]:
x = ["Now", "we", "are", "cooking", "with", 7, "ingredients"]
"This" in x

In [10]:
import pandas
import seaborn
import matplotlib

import pandas as pd

In [15]:
import numpy as np

In [16]:
data = {'planet': ['Mercury', 'Venus', 'Earth', 'Mars',
                   'Jupiter', 'Saturn', 'Uranus', 'Neptune'],
       'radius_km': [2440, 6052, 6371, 3390, 69911, 58232,
                     25362, 24622],
       'moons': [0, 0, 1, 2, 80, 83, 27, 14]
        }
df = pd.DataFrame(data)
df

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [17]:
print(df['moons'] < 20)

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: moons, dtype: bool